
read_verilog -sv /home/stillwater/dev/branes/clones/embodied-ai-architect/experiments/crew-ai/soc_optimization/demo_buggy/synth/alu_optimized.v
hierarchy -check -top alu_optimized
proc; opt; opt_clean; opt -full;
fsm; opt; opt_clean; opt -full;
memory; opt; opt_clean; opt -full;
techmap; opt; opt_clean; opt -full;
abc -g AND,OR,XOR,NAND,NOR,XNOR,MUX,AOI3,OAI3,AOI4,OAI4; opt; opt_clean; opt -full;
stat
write_json /home/stillwater/dev/branes/clones/embodied-ai-architect/experiments/crew-ai/soc_optimization/demo_buggy/synth/netlist.json
